# Project 3, Part 3 - ETL and MySQL db

# movieStats


## Author:  Sheneka Allen

In [1]:
# MySQL Database Requirements

# Use sqlalchemy with pandas to execute your SQL queries inside your notebook.

# Create a new database on your MySQL server and call it "movies".

# Make sure to have the following tables in your "movies" database:

# title_basics
# title_ratings
# title_genres
# genres
# tmdb_data

# Make sure to set a Primary Key for each table that isn't a joiner table 
# (e.g. title_genres is a joiner table).

# After creating each table, show the first 5 rows of that table using a SQL query.

# Make sure to run the "SHOW TABLES" SQL query at the end of your notebook to show 
# that all required tables have been created.

In [2]:
# Import standard libraries and tools
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

import pymysql
pymysql.install_as_MySQLdb()

from urllib.parse import quote_plus as urlquote # must have for special char pwd
from sqlalchemy import create_engine
from sqlalchemy_utils import create_database, database_exists

import json

In [3]:
# read in tmdb api combined results data file
tmdb_data = pd.read_csv('Data/tmdb_results_combined.csv.gz')
tmdb_data.head()

,imdb_id,adult,backdrop_path,belongs_to_collection,budget,genres,homepage,id,original_language,original_title,...,revenue,runtime,spoken_languages,status,tagline,title,video,vote_average,vote_count,certification
0,0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,tt0015414,0.0,NaN,NaN,0.0,"[{'id': 18, 'name': 'Drama'}]",NaN,607290.0,es,La tierra de los toros,...,0.0,53.0,"[{'english_name': 'No Language', 'iso_639_1': ...",Released,NaN,The Land of the Bulls,0.0,0.0,0.0,NaN
2,tt0113026,0.0,/vMFs7nw6P0bIV1jDsQpxAieAVnH.jpg,NaN,10000000.0,"[{'id': 35, 'name': 'Comedy'}, {'id': 10402, '...",NaN,62127.0,en,The Fantasticks,...,0.0,86.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,Try to remember the first time magic happened,The Fantasticks,0.0,5.5,22.0,NaN
3,tt0113086,0.0,NaN,NaN,0.0,[],NaN,612666.0,en,Florentino y el diablo,...,0.0,90.0,[],Released,NaN,Florentino y el diablo,0.0,0.0,0.0,NaN
4,tt0113092,0.0,NaN,NaN,0.0,"[{'id': 878, 'name': 'Science Fiction'}]",NaN,110977.0,en,For the Cause,...,0.0,100.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,The ultimate showdown on a forbidden planet.,For the Cause,0.0,4.4,7.0,NaN

In [4]:
# read in cleaned title basics data file
title_basics = pd.read_csv('Data/title_basics_cleaned.csv.gz')
title_basics.head()

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
0,tt0011801,movie,Tötet nicht mehr,Tötet nicht mehr,0,2019,0,0,"Action,Crime"
1,tt0015414,movie,La tierra de los toros,La tierra de los toros,0,2000,0,60,Missing
2,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,0,118,"Comedy,Fantasy,Romance"
3,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El Tango del Viudo y Su Espejo Deformante,0,2020,0,70,Drama
4,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018,0,122,Drama

In [5]:
# read in cleaned title ratings data file
title_ratings = pd.read_csv('Data/title_ratings_cleaned.csv.gz')
title_ratings.head()

      tconst  averageRating  numVotes
0  tt0000001            5.7      1892
1  tt0000002            5.9       252
2  tt0000003            6.5      1685
3  tt0000004            5.7       165
4  tt0000005            6.2      2499

In [6]:
# delete certain columns by column number in tmdb_data 
tmdb_data = tmdb_data.drop(tmdb_data.columns[[1, 2, 3, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 17, 18, 19, 20, 21, 22, 23, 24]], axis=1)  # df.columns is zero-based pd.Index
tmdb_data.head()

     imdb_id      budget  revenue certification
0          0         NaN      NaN           NaN
1  tt0015414         0.0      0.0           NaN
2  tt0113026  10000000.0      0.0           NaN
3  tt0113086         0.0      0.0           NaN
4  tt0113092         0.0      0.0           NaN

In [7]:
tmdb_data.isnull().sum()

imdb_id             0
budget              2
revenue             2
certification    4379
dtype: int64

In [8]:
tmdb_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5227 entries, 0 to 5226
Data columns (total 4 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   imdb_id        5227 non-null   object
 1   budget         5225 non-null   float64
 2   revenue        5225 non-null   float64
 3   certification  848 non-null    object
dtypes: float64(2), object(2)
memory usage: 163.5+ KB

In [9]:
tmdb_data['certification'].value_counts()

R          468
PG-13      186
NR          88
PG          68
G           29
NC-17        7
Unrated      1
-            1
Name: certification, dtype: int64

In [10]:
# replace all nulls in budget and revenue columns with 0
tmdb_data[['budget', 'revenue']] = tmdb_data[['budget','revenue']].fillna(0)

In [11]:
# Remove '-' and nulls from certification
tmdb_data['certification'] = tmdb_data['certification'].str.replace("-", "Missing")
tmdb_data.certification = tmdb_data.certification.fillna('Missing')

In [12]:
tmdb_data.head(10)

     imdb_id      budget     revenue certification
0          0         0.0         0.0       Missing
1  tt0015414         0.0         0.0       Missing
2  tt0113026  10000000.0         0.0       Missing
3  tt0113086         0.0         0.0       Missing
4  tt0113092         0.0         0.0       Missing
5  tt0116391         0.0         0.0       Missing
6  tt0116748         0.0         0.0       Missing
7  tt0118694    150000.0  12854953.0            PG
8  tt0118852         0.0         0.0             R
9  tt0118911         0.0         0.0       Missing

In [13]:
## create a new column with a single list of genres
title_basics['genres_split'] = title_basics['genres'].str.split(',')
title_basics.head()

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres,genres_split
0,tt0011801,movie,Tötet nicht mehr,Tötet nicht mehr,0,2019,0,0,"Action,Crime","[Action, Crime]"
1,tt0015414,movie,La tierra de los toros,La tierra de los toros,0,2000,0,60,Missing,[Missing]
2,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,0,118,"Comedy,Fantasy,Romance","[Comedy, Fantasy, Romance]"
3,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El Tango del Viudo y Su Espejo Deformante,0,2020,0,70,Drama,[Drama]
4,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018,0,122,Drama,[Drama]

In [14]:
# rename Pandas columns to lower case
title_basics.columns= title_basics.columns.str.lower()
title_basics.columns

Index(['tconst', 'titletype', 'primarytitle', 'originaltitle', 'isadult',
       'startyear', 'endyear', 'runtimeminutes', 'genres', 'genres_split'],
      dtype='object')

In [15]:
# check for nulls
title_basics.isnull().sum()

tconst            0
titletype         0
primarytitle      0
originaltitle     0
isadult           0
startyear         0
endyear           0
runtimeminutes    0
genres            0
genres_split      0
dtype: int64

In [16]:
# separate list of genres into new rows for each movie
exploded_genres = title_basics.explode('genres_split')
exploded_genres.head()

,tconst,titletype,primarytitle,originaltitle,isadult,startyear,endyear,runtimeminutes,genres,genres_split
0,tt0011801,movie,Tötet nicht mehr,Tötet nicht mehr,0,2019,0,0,"Action,Crime",Action
0,tt0011801,movie,Tötet nicht mehr,Tötet nicht mehr,0,2019,0,0,"Action,Crime",Crime
1,tt0015414,movie,La tierra de los toros,La tierra de los toros,0,2000,0,60,Missing,Missing
2,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,0,118,"Comedy,Fantasy,Romance",Comedy
2,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,0,118,"Comedy,Fantasy,Romance",Fantasy

In [17]:
# convert string column to list of strings 
genres_split = title_basics['genres'].str.split(",")

# explode string using unique.explode()
unique_genres = genres_split.explode().unique()
unique_genres

array(['Action', 'Crime', 'Missing', 'Comedy', 'Fantasy', 'Romance',
       'Drama', 'War', 'Sport', 'Horror', 'Sci-Fi', 'Music', 'Thriller',
       'Mystery', 'Adventure', 'Musical', 'Biography', 'Documentary',
       'Animation', 'Family', 'History', 'Adult', 'Western', 'Short',
       'Reality-TV', 'News', 'Game-Show', 'Talk-Show'], dtype=object)

In [18]:
# use unique() to get unique genres from genres_split list
unique_genres = sorted(exploded_genres['genres_split'].unique())
unique_genres

['Action',
 'Adult',
 'Adventure',
 'Animation',
 'Biography',
 'Comedy',
 'Crime',
 'Documentary',
 'Drama',
 'Family',
 'Fantasy',
 'Game-Show',
 'History',
 'Horror',
 'Missing',
 'Music',
 'Musical',
 'Mystery',
 'News',
 'Reality-TV',
 'Romance',
 'Sci-Fi',
 'Short',
 'Sport',
 'Talk-Show',
 'Thriller',
 'War',
 'Western']

In [19]:
# save just tconst and genres_split columns in new df
title_genres = exploded_genres[['tconst', 'genres_split']].copy()
title_genres.head()

      tconst genres_split
0  tt0011801       Action
0  tt0011801        Crime
1  tt0015414      Missing
2  tt0035423       Comedy
2  tt0035423      Fantasy

In [20]:
## Making the genres mapper dictionary, replace genres strings with integers
# genres_strings(key):genres_ids(values)

genres_ints = range(len(unique_genres))
genres_map = dict(zip(unique_genres, genres_ints))
genres_map

{'Action': 0,
 'Adult': 1,
 'Adventure': 2,
 'Animation': 3,
 'Biography': 4,
 'Comedy': 5,
 'Crime': 6,
 'Documentary': 7,
 'Drama': 8,
 'Family': 9,
 'Fantasy': 10,
 'Game-Show': 11,
 'History': 12,
 'Horror': 13,
 'Missing': 14,
 'Music': 15,
 'Musical': 16,
 'Mystery': 17,
 'News': 18,
 'Reality-TV': 19,
 'Romance': 20,
 'Sci-Fi': 21,
 'Short': 22,
 'Sport': 23,
 'Talk-Show': 24,
 'Thriller': 25,
 'War': 26,
 'Western': 27}

In [21]:
## make new integer genre_id and drop string genres
title_genres['genre_id'] = title_genres['genres_split'].map(genres_map)
title_genres = title_genres.drop(columns='genres_split')

In [22]:
title_genres.head()

      tconst  genre_id
0  tt0011801         0
0  tt0011801         6
1  tt0015414        14
2  tt0035423         5
2  tt0035423        10

In [23]:
# make a genres df with named columns from keys and values

genres = pd.DataFrame ({'genre_name': genres_map.keys(),
                              'genre_id' : genres_map.values()})
genres.head()

  genre_name  genre_id
0     Action         0
1      Adult         1
2  Adventure         2
3  Animation         3
4  Biography         4

In [24]:
title_basics.drop(['titletype', 'isadult', 'originaltitle', 'genres', 'genres_split'], axis=1, inplace=True)
title_basics.head(3)

      tconst            primarytitle  startyear  endyear  runtimeminutes
0  tt0011801        Tötet nicht mehr       2019        0               0
1  tt0015414  La tierra de los toros       2000        0              60
2  tt0035423          Kate & Leopold       2001        0             118

In [25]:
# To use a string column as the primary key, 
# must provide the SQL Alchemy datatype schema 
# for tconst column when creating the table

## get max string length, then use 1 larger than the max_str_len 
# for your String/Text object `Text(max_str_len +1)

max_str_len = title_genres['tconst'].fillna('').map(len).max()
genre_name_len = genres['genre_name'].fillna('').map(len).max()

In [26]:
# import every datatype from SQL alchemy using asterisk (*)
from sqlalchemy.types import *

## Calculate max string lengths for object columns
key_len = title_basics['tconst'].fillna('').map(len).max()
pri_title_len = title_basics['primarytitle'].fillna('').map(len).max()
imdb_id_len = tmdb_data['imdb_id'].fillna('').map(len).max()
cert_len = tmdb_data['certification'].fillna('').map(len).max()

## Create a schema dictionary for title_basics using SQL alchemy datatype objects
title_basics_schema = {
     "tconst": String(key_len+1), 
     "primarytitle": Text(pri_title_len+1),
     'startyear': Integer(),
     'endyear': Integer(),
     'runtimeminutes': Integer()}

## Create a schema dictionary for genres using SQL alchemy datatype objects
genres_schema = {
     "genre_name": String(max_str_len+1),
     'genre_id': Integer()}

## Create a schema dictionary for tmdb_data using SQL alchemy datatype objects
tmdb_data_schema = {
     "imdb_id": String(imdb_id_len+1),
     'budget': Float(),
     'revenue': Float(),
     'certification': Text(cert_len+1)}

In [27]:
# Load my login credentials
with open('/Users/shenekaallen/.secret/mysql.json') as f:
    login = json.load(f)
    
## Display the keys of the loaded dict
login.keys()

dict_keys(['username', 'password'])

In [28]:
# connect to SQL db using sqlalchemy library

# from sqlalchemy.engine import create_engine, 
## MUST use quote_plus lib for special char in pwd
connection = f"mysql+pymysql://{login['username']}:{urlquote(login['password'])}@localhost/movies"

In [29]:
engine = create_engine(connection)

In [30]:
# create database BeltExam
if database_exists(connection):
    print("It exists")
else:
    create_database(connection)
    print("Created database")

It exists

In [31]:
# Save to sql with dtype and index=False
title_basics.to_sql('title_basics',engine,dtype=title_basics_schema,if_exists='replace',index=False)

# Save to sql with dtype and index=False
genres.to_sql('genres',engine,dtype=genres_schema,if_exists='replace',index=False)

# Save to sql with dtype and index=False
tmdb_data.to_sql('tmdb_data',engine,dtype=tmdb_data_schema,if_exists='replace',index=False)

In [32]:
# Upload title_ratings to movies db
title_ratings.to_sql('title_ratings',engine,if_exists='replace',index=False)

# Upload title_genres to movies db
title_genres.to_sql('title_genres',engine,if_exists='replace', index=False)

In [33]:
# show all tables in movies db
q = """SHOW TABLES;"""
pd.read_sql(q, engine)

  Tables_in_movies
0           genres
1     title_basics
2     title_genres
3    title_ratings
4        tmdb_data

In [34]:
q = """SELECT *
FROM genres
LIMIT 5;"""
pd.read_sql(q,engine)

  genre_name  genre_id
0     Action         0
1      Adult         1
2  Adventure         2
3  Animation         3
4  Biography         4

In [35]:
q = """SELECT *
FROM title_basics
LIMIT 5;"""
pd.read_sql(q,engine)

,tconst,primarytitle,startyear,endyear,runtimeminutes
0,tt0011801,Tötet nicht mehr,2019,0,0
1,tt0015414,La tierra de los toros,2000,0,60
2,tt0035423,Kate & Leopold,2001,0,118
3,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020,0,70
4,tt0069049,The Other Side of the Wind,2018,0,122

In [36]:
q = """SELECT *
FROM title_genres
LIMIT 5;"""
pd.read_sql(q,engine)

      tconst  genre_id
0  tt0011801         0
1  tt0011801         6
2  tt0015414        14
3  tt0035423         5
4  tt0035423        10

In [37]:
q = """SELECT *
FROM title_ratings
LIMIT 5;"""
pd.read_sql(q,engine)

      tconst  averageRating  numVotes
0  tt0000001            5.7      1892
1  tt0000002            5.9       252
2  tt0000003            6.5      1685
3  tt0000004            5.7       165
4  tt0000005            6.2      2499

In [38]:
q = """SELECT *
FROM tmdb_data
LIMIT 5;"""
pd.read_sql(q,engine)

     imdb_id      budget  revenue certification
0          0         0.0      0.0       Missing
1  tt0015414         0.0      0.0       Missing
2  tt0113026  10000000.0      0.0       Missing
3  tt0113086         0.0      0.0       Missing
4  tt0113092         0.0      0.0       Missing